In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
refugees_df = pd.read_csv('../data/refugees.csv', skipfooter=4, engine='python')

In [3]:
refugees_df.head()

,Country or territory of asylum or residence,Country or territory of origin,Year,Refugees*,Refugees assisted by UNHCR,Total refugees and people in refugee-like situations**,Total refugees and people in refugee-like situations assisted by UNHCR
0,Afghanistan,Iran (Islamic Rep. of),2021,38,38,38,38
1,Afghanistan,Pakistan,2021,72188,123,72188,123
2,Albania,China,2021,14,0,14,0
3,Albania,Egypt,2021,5,0,5,0
4,Albania,Iraq,2021,5,0,5,0

In [4]:
refugees_df = refugees_df.rename(columns={"Country or territory of asylum or residence": "Acceptor", "Country or territory of origin":"Origin", "Total refugees and people in refugee-like situations**": "Refugees"})

In [5]:
refugees_df.isnull().values.any()

False

In [6]:
refugees_df = refugees_df.drop(columns=['Refugees assisted by UNHCR','Refugees*','Total refugees and people in refugee-like situations assisted by UNHCR'])

In [7]:
refugees_df.head()

      Acceptor                  Origin  Year  Refugees
0  Afghanistan  Iran (Islamic Rep. of)  2021        38
1  Afghanistan                Pakistan  2021     72188
2      Albania                   China  2021        14
3      Albania                   Egypt  2021         5
4      Albania                    Iraq  2021         5

How many countries of origin and acceptors?

In [8]:
refugees_df["Origin"].nunique()

201

In [9]:
refugees_df["Acceptor"].nunique()

183

How many years does the data span?

In [10]:
refugees_df["Year"].nunique()

47

Total number of refugees accepted by each country over the entire period

In [11]:
total_accepted_df = refugees_df.groupby(by="Acceptor").sum()
total_accepted_df = total_accepted_df.reset_index()
total_accepted_df = total_accepted_df.drop(columns="Year")

Top five highest accepting countries

In [12]:
total_accepted_df = total_accepted_df.rename(columns={"Refugees" : "Total Refugees"})

In [13]:
total_accepted_df.sort_values(by="Total Refugees", ascending=False)

                             Acceptor  Total Refugees
123                          Pakistan        78221903
77             Iran (Islamic Rep. of)        71483585
63                            Germany        31540659
165                            Turkey        26264664
155                             Sudan        24056451
..                                ...             ...
106  Micronesia (Federated States of)              10
138             Saint Kitts and Nevis              10
139                       Saint Lucia              10
66                            Grenada               5
24                         Cabo Verde               5

[183 rows x 2 columns]

Top five highest departing countries

In [18]:
total_departing_df = refugees_df.groupby(by="Origin").sum()
total_departing_df = total_departing_df.reset_index()
total_departing_df = total_departing_df.drop(columns="Year")
total_departing_df.sort_values(by="Refugees", ascending=False)

               Origin   Refugees
0         Afghanistan  142234967
192     Unknown/other   54982960
174  Syrian Arab Rep.   50782628
85               Iraq   28266939
62           Ethiopia   23856215
..                ...        ...
141       Puerto Rico         36
122             Nauru         25
152        San Marino         20
104        Luxembourg         10
151             Samoa          5

[201 rows x 2 columns]

In [15]:
total_departing_df.head()

        Origin   Refugees
0  Afghanistan  142234967
1      Albania     338564
2      Algeria     195008
3      Andorra         87
4       Angola   13054928

In [16]:
total_departing_df.tail()

             Origin  Refugees
196        Viet Nam  16457922
197  Western Sahara   6157643
198           Yemen    598120
199          Zambia     15671
200        Zimbabwe    814630

In [19]:
total_departing_df[total_departing_df["Origin"]=="United States of America"]

                       Origin  Refugees
191  United States of America     39369

**Data for 2022**

*Top 5 most accepting countries*

In [30]:
refugees_2021_df = refugees_df[refugees_df["Year"]==2021]
total_accepted_2021_df = refugees_2021_df.groupby(by="Acceptor").sum()
total_accepted_2021_df = total_accepted_2021_df.reset_index()
total_accepted_2021_df = total_accepted_2021_df.drop(columns="Year")
total_accepted_2021_df.sort_values(by="Refugees", ascending=False)

                     Acceptor  Refugees
148                    Turkey   3696831
151                    Uganda   1475311
113                  Pakistan   1438523
58                    Germany   1235160
138                     Sudan   1068339
..                        ...       ...
149              Turkmenistan        20
139                  Suriname        19
158                Uzbekistan        13
52                       Fiji        13
150  Turks and Caicos Islands         8

[163 rows x 2 columns]

**Making a function to produce a df that gives the origin/host and number of refugees by year**

In [31]:
def make_aggregated(country_type, yr):
    refugees_yr_df = refugees_df[refugees_df["Year"]==yr]
    total_accepted_df = refugees_yr_df.groupby(by=country_type).sum()
    total_accepted_df = total_accepted_df.reset_index()
    total_accepted_df = total_accepted_df.drop(columns="Year")
    return total_accepted_df.sort_values(by="Refugees", ascending=False)

In [53]:
df = make_aggregated("Origin", 2021)

In [54]:
df.head()

                     Origin  Refugees
162        Syrian Arab Rep.   6761560
0               Afghanistan   2610067
153             South Sudan   2277919
111                 Myanmar   1127586
46   Dem. Rep. of the Congo    864510

In [51]:
df = make_aggregated("Acceptor", 2021)

In [52]:
df.head()

     Acceptor  Refugees
148    Turkey   3696831
151    Uganda   1475311
113  Pakistan   1438523
58    Germany   1235160
138     Sudan   1068339

**Show the history of accepting refugees**

In [60]:
country_list = refugees_df["Acceptor"].unique()

In [61]:
country_list

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Armenia', 'Australia', 'Austria', 'Azerbaijan', 'Bahamas',
       'Bahrain', 'Bangladesh', 'Belarus', 'Belgium', 'Belize', 'Benin',
       'Bolivia (Plurinational State of)', 'Bosnia and Herzegovina',
       'Botswana', 'Brazil', 'Bulgaria', 'Burkina Faso', 'Burundi',
       'Cambodia', 'Cameroon', 'Canada', 'Cayman Islands',
       'Central African Rep.', 'Chad', 'Chile', 'China',
       'China, Hong Kong SAR', 'Colombia', 'Congo, Republic of',
       'Costa Rica', "Côte d'Ivoire", 'Croatia', 'Cuba', 'Curaçao',
       'Cyprus', 'Czechia', 'Dem. Rep. of the Congo', 'Denmark',
       'Djibouti', 'Dominican Rep.', 'Ecuador', 'Egypt', 'El Salvador',
       'Eritrea', 'Estonia', 'Eswatini', 'Ethiopia', 'Fiji', 'Finland',
       'France', 'Gabon', 'Gambia', 'Georgia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Guyana',
       'Honduras', 'Hungary', 'Iceland', 'India', 'Indonesia',
       'Iran (Islamic Rep. of)', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kazakhstan', 'Kenya', 'Kuwait',
       'Kyrgyzstan', 'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Liechtenstein', 'Lithuania', 'Luxembourg', 'Madagascar', 'Malawi',
       'Malaysia', 'Mali', 'Malta', 'Mauritania', 'Mauritius', 'Mexico',
       'Monaco', 'Montenegro', 'Morocco', 'Mozambique', 'Namibia',
       'Nauru', 'Nepal', 'Netherlands', 'New Zealand', 'Nicaragua',
       'Niger', 'Nigeria', 'North Macedonia', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru',
       'Philippines', 'Poland', 'Portugal', 'Qatar', 'Rep. of Korea',
       'Rep. of Moldova', 'Romania', 'Russian Federation', 'Rwanda',
       'Saudi Arabia', 'Senegal', 'Serbia and Kosovo: S/RES/1244 (1999)',
       'Sierra Leone', 'Slovakia', 'Slovenia', 'Somalia', 'South Africa',
       'South Sudan', 'Spain', 'Sri Lanka', 'Sudan', 'Suriname', 'Sweden',
       'Switzerland', 'Syrian Arab Rep.', 'Tajikistan', 'Thailand',
       'Togo', 'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Turkmenistan',
       'Turks and Caicos Islands', 'Uganda', 'Ukraine',
       'United Arab Emirates', 'United Kingdom',
       'United Rep. of Tanzania', 'United States of America', 'Uruguay',
       'Uzbekistan', 'Venezuela (Bolivarian Republic of)', 'Yemen',
       'Zambia', 'Zimbabwe', 'Saint Kitts and Nevis',
       'Sint Maarten (Dutch part)', 'Haiti', 'Mongolia', 'Samoa',
       'Antigua and Barbuda', 'Micronesia (Federated States of)',
       'Solomon Islands', 'Singapore', 'Saint Lucia', 'Grenada',
       'Viet Nam', 'Vanuatu', 'China, Macao SAR', 'Palau', 'Comoros',
       'French Guiana', 'Unknown/other', 'Cabo Verde',
       "Lao People's Dem. Rep."], dtype=object)

In [64]:
refugees_df[refugees_df["Acceptor"]=="United States of America"].groupby(by="Year").sum()

      Refugees
Year
1975    530000
1976    500000
1977    684700
1978    734000
1979    734000
1980    403684
1981    537375
1982    620257
1983    655532
1984    626909
1985    492806
1986    398633
1987    365726
1988    377769
1989    411496
1990    464887
1991    513885
1992    579938
1993    623056
1994    631046
1995    623279
1996    607005
1997    563813
1998    533951
1999    521134
2000    508209
2001    515851
2002    485173
2003    452536
2004    420788
2005    379330
2006    843434
2007    281154
2008    279468
2009    275393
2010    264505
2011    264752
2012    262006
2013    263653
2014    267214
2015    273198
2016    272963
2017    287135
2018    313242
2019    341715
2020    340846
2021    337870